IsolateCategoriesTemporary Method
 Set categories to be temporarily isolated in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void IsolateCategoriesTemporary(
	ICollection<ElementId> elementIds
)
Visual Basic
Public Sub IsolateCategoriesTemporary ( _
	elementIds As ICollection(Of ElementId) _
)
Visual C++
public:
void IsolateCategoriesTemporary(
	ICollection<ElementId^>^ elementIds
)
Parameters
elementIds
Type: System.Collections.GenericICollectionElementId
 Ids of categories to be isolated.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  Some elements in elementIds do not correspond to a Category.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →